# IExternalDBApplication Methods

---
The IExternalDBApplication type exposes the following members.
| Name| Description
---|---|---
| OnShutdown| Implement this method to execute some tasks when Autodesk Revit shuts down.
| OnStartup| Implement this method to execute some tasks when Autodesk Revit starts.
Top
#### Reference
IExternalDBApplication Interface
Autodesk.Revit.DB Namespace